<a href="https://colab.research.google.com/github/amatyaagrata/ConceptandTechnologyofAI/blob/Workshop3/Workshop3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. Sorting and Subsetting:
Complete all following Task:
• Dataset for the Task: "titanic.csv"

In [103]:
import pandas as pd
import numpy as np

# Load the dataset
df = pd.read_csv('/content/Titanic-Dataset.csv')

# Check info of the DataFrame
print("Dataset Info:")
print(df.info())

Dataset Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

1. Create a DataFrame called fare that contains only the Fare column of the Titanic dataset. Print the
head of the result.

In [104]:
fare = df[['Fare']]
print("1. Fare DataFrame (head):")
print(fare.head())

1. Fare DataFrame (head):
      Fare
0   7.2500
1  71.2833
2   7.9250
3  53.1000
4   8.0500

2. Create a DataFrame called class age that contains only the Pclass and Age columns of the Titanic
dataset, in that order. Print the head of the result.

In [105]:
class_age = df[['Pclass', 'Age']]
print("2. Class and Age DataFrame (head):")
print(class_age.head())

2. Class and Age DataFrame (head):
   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0

3. Create a DataFrame called survived gender that contains the Survived and Sex columns of the
Titanic dataset, in that order.Print the head of the result.

In [106]:
survived_gender = df[['Survived', 'Sex']]
print("3. Survived and Gender DataFrame (head):")
print(survived_gender.head())

3. Survived and Gender DataFrame (head):
   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

Problem - 2 - Subsetting:
Complete all the following Task:
Subsetting Rows:
1. Filter the Titanic dataset for cases where the passenger’s fare is greater than 100, assigning it
to fare gt 100.View the printed result.

In [107]:
fare_gt_100 = df[df['Fare'] > 100]
print("1. Passengers with Fare > 100:")
print(fare_gt_100)
print(f"\nNumber of passengers with Fare > 100: {len(fare_gt_100)}")

1. Passengers with Fare > 100:
     PassengerId  Survived  Pclass  \
27            28         0       1
31            32         1       1
88            89         1       1
118          119         0       1
195          196         1       1
215          216         1       1
258          259         1       1
268          269         1       1
269          270         1       1
297          298         0       1
299          300         1       1
305          306         1       1
306          307         1       1
307          308         1       1
311          312         1       1
318          319         1       1
319          320         1       1
325          326         1       1
332          333         0       1
334          335         1       1
337          338         1       1
341          342         1       1
373          374         0       1
377          378         0       1
380          381         1       1
390          391         1       1
393          394         1       1
435          436         1       1
438          439         0       1
498          499         0       1
505          506         0       1
527          528         0       1
537          538         1       1
544          545         0       1
550          551         1       1
557          558         0       1
581          582         1       1
609          610         1       1
659          660         0       1
660          661         1       1
679          680         1       1
689          690         1       1
698          699         0       1
700          701         1       1
708          709         1       1
716          717         1       1
730          731         1       1
737          738         1       1
742          743         1       1
763          764         1       1
779          780         1       1
802          803         1       1
856          857         1       1

                                                  Name     Sex    Age  SibSp  \
27                      Fortune, Mr. Charles Alexander    male  19.00      3
31      Spencer, Mrs. William Augustus (Marie Eugenie)  female    NaN      1
88                          Fortune, Miss. Mabel Helen  female  23.00      3
118                           Baxter, Mr. Quigg Edmond    male  24.00      0
195                               Lurette, Miss. Elise  female  58.00      0
215                            Newell, Miss. Madeleine  female  31.00      1
258                                   Ward, Miss. Anna  female  35.00      0
268      Graham, Mrs. William Thompson (Edith Junkins)  female  58.00      0
269                             Bissette, Miss. Amelia  female  35.00      0
297                       Allison, Miss. Helen Loraine  female   2.00      1
299    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female  50.00      0
305                     Allison, Master. Hudson Trevor    male   0.92      1
306                            Fleming, Miss. Margaret  female    NaN      0
307  Penasco y Castellana, Mrs. Victor de Satode (M...  female  17.00      1
311                         Ryerson, Miss. Emily Borie  female  18.00      2
318                           Wick, Miss. Mary Natalie  female  31.00      0
319  Spedden, Mrs. Frederic Oakley (Margaretta Corn...  female  40.00      1
325                           Young, Miss. Marie Grice  female  36.00      0
332                          Graham, Mr. George Edward    male  38.00      0
334  Frauenthal, Mrs. Henry William (Clara Heinshei...  female    NaN      1
337                    Burns, Miss. Elizabeth Margaret  female  41.00      0
341                     Fortune, Miss. Alice Elizabeth  female  24.00      3
373                                Ringhini, Mr. Sante    male  22.00      0
377                          Widener, Mr. Harry Elkins    male  27.00      0
380                              Bidois, Miss. Rosalie  female  42.00      0
390                         Carter, Mr. William Ernest    male  36.00      1
393                             Newell, Miss. Marjorie  female  23.00      1
435                          Carter, Miss. Lucile Polk  female  14.00      1
438                                  Fortune, Mr. Mark    male  64.00      1
498    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00      1
505         Penasco y Castellana, Mr. Victor de Satode    male  18.00      1
527                                 Farthing, Mr. John    male    NaN      0
537                                LeRoy, Miss. Bertha  female  30.00      0
544                         Douglas, Mr. Walter Donald    male  50.00      1
550                        Thayer, Mr. John Borland Jr    male  17.00      0
557                                Robbins, Mr. Victor    male    NaN      0
581  Thayer, Mrs. John Borland (Marian Longstreth M...  female  39.00      1
609                          Shutes, Miss. Elizabeth W  female  40.00      0
659                         Newell, Mr. Arthur Webster    male  58.00      0
660                      Frauenthal, Dr. Henry William    male  50.00      2
679                 Cardeza, Mr. Thomas Drake Martinez    male  36.00      0
689                  Madill, Miss. Georgette Alexandra  female  15.00      0
698                           Thayer, Mr. John Borland    male  49.00      1
700  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  female  18.00      1
708                               Cleaver, Miss. Alice  female  22.00      0
716                      Endres, Miss. Caroline Louise  female  38.00      0
730                      Allen, Miss. Elisabeth Walton  female  29.00      0
737                             Lesurer, Mr. Gustave J    male  35.00      0
742              Ryerson, Miss. Susan Parker "Suzette"  female  21.00      2
763          Carter, Mrs. William Ernest (Lucile Polk)  female  36.00      1
779  Robert, Mrs. Edward Scott (Elisabeth Walton Mc...  female  43.00      0
802                Carter, Master. William Thornton II    male  11.00      1
856         Wick, Mrs. George Dennick (Mary Hitchcock)  female  45.00      1

     Parch    Ticket      Fare            Cabin Embarked
27       2     19950  263.0000      C23 C25 C27        S
31       0  PC 17569  146.5208              B78        C
88       2     19950  263.0000      C23 C25 C27        S
118      1  PC 17558  247.5208          B58 B60        C
195      0  PC 17569  146.5208              B80        C
215      0     35273  113.2750              D36        C
258      0  PC 17755  512.3292              NaN        C
268      1  PC 17582  153.4625             C125        S
269      0  PC 17760  135.6333              C99        S
297      2    113781  151.5500          C22 C26        S
299      1  PC 17558  247.5208          B58 B60        C
305      2    113781  151.5500          C22 C26        S
306      0     17421  110.8833              NaN        C
307      0  PC 17758  108.9000              C65        C
311      2  PC 17608  262.3750  B57 B59 B63 B66        C
318      2     36928  164.8667               C7        S
319      1     16966  134.5000              E34        C
325      0  PC 17760  135.6333              C32        C
332      1  PC 17582  153.4625              C91        S
334      0  PC 17611  133.6500              NaN        S
337      0     16966  134.5000              E40        C
341      2     19950  263.0000      C23 C25 C27        S
373      0  PC 17760  135.6333              NaN        C
377      2    113503  211.5000              C82        C
380      0  PC 17757  227.5250              NaN        C
390      2    113760  120.0000          B96 B98        S
393      0     35273  113.2750              D36        C
435      2    113760  120.0000          B96 B98        S
438      4     19950  263.0000      C23 C25 C27        S
498      2    113781  151.5500          C22 C26        S
505      0  PC 17758  108.9000              C65        C
527      0  PC 17483  221.7792              C95        S
537      0  PC 17761  106.4250              NaN        C
544      0  PC 17761  106.4250              C86        C
550      2     17421  110.8833              C70        C
557      0  PC 17757  227.5250              NaN        C
581      1     17421  110.8833              C68        C
609      0  PC 17582  153.4625             C125        S
659      2     35273  113.2750              D48        C
660      0  PC 17611  133.6500              NaN        S
679      1  PC 17755  512.3292      B51 B53 B55        C
689      1     24160  211.3375               B5        S
698      1     17421  110.8833              C68        C
700      0  PC 17757  227.5250          C62 C64        C
708      0    113781  151.5500              NaN        S
716      0  PC 17757  227.5250              C45        C
730      0     24160  211.3375               B5        S
737      0  PC 17755  512.3292             B101        C
742      2  PC 17608  262.3750  B57 B59 B63 B66        C
763      2    113760  120.0000          B96 B98        S
779      1     24160  211.3375               B3        S
802      2    113760  120.0000          B96 B98        S
856      1     36928  164.8667              NaN        S

Number of passengers with Fare > 100: 53

2. Filter the Titanic dataset for cases where the passenger’s class (Pclass) is 1, assigning it to
first class.View the printed result.

In [108]:
first_class = df[df['Pclass'] == 1]
print("2. First Class Passengers:")
print(first_class)
print(f"Number of first class passengers: {len(first_class)}")

2. First Class Passengers:
     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
6              7         0       1
11            12         1       1
23            24         1       1
..           ...       ...     ...
871          872         1       1
872          873         0       1
879          880         1       1
887          888         1       1
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
11                            Bonnell, Miss. Elizabeth  female  58.0      0
23                        Sloper, Mr. William Thompson    male  28.0      0
..                                                 ...     ...   ...    ...
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch    Ticket     Fare        Cabin Embarked
1        0  PC 17599  71.2833          C85        C
3        0    113803  53.1000         C123        S
6        0     17463  51.8625          E46        S
11       0    113783  26.5500         C103        S
23       0    113788  35.5000           A6        S
..     ...       ...      ...          ...      ...
871      1     11751  52.5542          D35        S
872      0       695   5.0000  B51 B53 B55        S
879      1     11767  83.1583          C50        C
887      0    112053  30.0000          B42        S
889      0    111369  30.0000         C148        C

[216 rows x 12 columns]
Number of first class passengers: 216

3. Filter the Titanic dataset for cases where the passenger’s age is less than 18 and the passenger
is female (Sex is "female"), assigning it to female under 18. View the printed result.

In [133]:
female_under_18 = df[(df['Age'] < 18) & (df['Sex'] == 'female')]
print("3. Female Passengers Under 18:")
print(female_under_18)
print("Number of female passengers under 18: {len(female_under_18)}")

3. Female Passengers Under 18:
     PassengerId  Survived  Pclass  \
9             10         1       2
10            11         1       3
14            15         0       3
22            23         1       3
24            25         0       3
39            40         1       3
43            44         1       2
58            59         1       2
68            69         1       3
71            72         0       3
84            85         1       2
111          112         0       3
114          115         0       3
119          120         0       3
147          148         0       3
156          157         1       3
172          173         1       3
184          185         1       3
205          206         0       3
208          209         1       3
233          234         1       3
237          238         1       2
297          298         0       1
307          308         1       1
329          330         1       1
374          375         0       3
381          382         1       3
389          390         1       2
419          420         0       3
435          436         1       1
446          447         1       2
448          449         1       3
469          470         1       3
479          480         1       3
504          505         1       1
530          531         1       2
535          536         1       2
541          542         0       3
542          543         0       3
618          619         1       2
634          635         0       3
642          643         0       3
644          645         1       3
689          690         1       1
691          692         1       3
720          721         1       2
750          751         1       2
777          778         1       3
780          781         1       3
781          782         1       1
813          814         0       3
830          831         1       3
852          853         0       3
853          854         1       1
875          876         1       3

                                                  Name     Sex    Age  SibSp  \
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.00      1
10                     Sandstrom, Miss. Marguerite Rut  female   4.00      1
14                Vestrom, Miss. Hulda Amanda Adolfina  female  14.00      0
22                         McGowan, Miss. Anna "Annie"  female  15.00      0
24                       Palsson, Miss. Torborg Danira  female   8.00      3
39                         Nicola-Yarred, Miss. Jamila  female  14.00      1
43            Laroche, Miss. Simonne Marie Anne Andree  female   3.00      1
58                        West, Miss. Constance Mirium  female   5.00      1
68                     Andersson, Miss. Erna Alexandra  female  17.00      4
71                          Goodwin, Miss. Lillian Amy  female  16.00      5
84                                 Ilett, Miss. Bertha  female  17.00      0
111                               Zabour, Miss. Hileni  female  14.50      1
114                              Attalah, Miss. Malake  female  17.00      0
119                  Andersson, Miss. Ellis Anna Maria  female   2.00      4
147                   Ford, Miss. Robina Maggie "Ruby"  female   9.00      2
156                   Gilnagh, Miss. Katherine "Katie"  female  16.00      0
172                       Johnson, Miss. Eleanor Ileen  female   1.00      1
184                Kink-Heilmann, Miss. Luise Gretchen  female   4.00      0
205                         Strom, Miss. Telma Matilda  female   2.00      0
208                          Carr, Miss. Helen "Ellen"  female  16.00      0
233                     Asplund, Miss. Lillian Gertrud  female   5.00      4
237                   Collyer, Miss. Marjorie "Lottie"  female   8.00      0
297                       Allison, Miss. Helen Loraine  female   2.00      1
307  Penasco y Castellana, Mrs. Victor de Satode (M...  female  17.00      1
329                       Hippach, Miss. Jean Gertrude  female  16.00      0
374                         Palsson, Miss. Stina Viola  female   3.00      3
381                        Nakid, Miss. Maria ("Mary")  female   1.00      0
389                              Lehmann, Miss. Bertha  female  17.00      0
419                          Van Impe, Miss. Catharina  female  10.00      0
435                          Carter, Miss. Lucile Polk  female  14.00      1
446                  Mellinger, Miss. Madeleine Violet  female  13.00      0
448                     Baclini, Miss. Marie Catherine  female   5.00      2
469                      Baclini, Miss. Helene Barbara  female   0.75      2
479                           Hirvonen, Miss. Hildur E  female   2.00      0
504                              Maioni, Miss. Roberta  female  16.00      0
530                           Quick, Miss. Phyllis May  female   2.00      1
535                             Hart, Miss. Eva Miriam  female   7.00      0
541               Andersson, Miss. Ingeborg Constanzia  female   9.00      4
542                  Andersson, Miss. Sigrid Elisabeth  female  11.00      4
618                        Becker, Miss. Marion Louise  female   4.00      2
634                                 Skoog, Miss. Mabel  female   9.00      3
642                      Skoog, Miss. Margit Elizabeth  female   2.00      3
644                             Baclini, Miss. Eugenie  female   0.75      2
689                  Madill, Miss. Georgette Alexandra  female  15.00      0
691                                 Karun, Miss. Manca  female   4.00      0
720                  Harper, Miss. Annie Jessie "Nina"  female   6.00      0
750                                  Wells, Miss. Joan  female   4.00      1
777                      Emanuel, Miss. Virginia Ethel  female   5.00      0
780                               Ayoub, Miss. Banoura  female  13.00      0
781          Dick, Mrs. Albert Adrian (Vera Gillespie)  female  17.00      1
813                 Andersson, Miss. Ebba Iris Alfrida  female   6.00      4
830            Yasbeck, Mrs. Antoni (Selini Alexander)  female  15.00      1
852                            Boulos, Miss. Nourelain  female   9.00      1
853                          Lines, Miss. Mary Conover  female  16.00      0
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.00      0

     Parch         Ticket      Fare    Cabin Embarked  Age_filled  \
9        0         237736   30.0708      NaN        C       14.00
10       1        PP 9549   16.7000       G6        S        4.00
14       0         350406    7.8542      NaN        S       14.00
22       0         330923    8.0292      NaN        Q       15.00
24       1         349909   21.0750      NaN        S        8.00
39       0           2651   11.2417      NaN        C       14.00
43       2  SC/Paris 2123   41.5792      NaN        C        3.00
58       2     C.A. 34651   27.7500      NaN        S        5.00
68       2        3101281    7.9250      NaN        S       17.00
71       2        CA 2144   46.9000      NaN        S       16.00
84       0     SO/C 14885   10.5000      NaN        S       17.00
111      0           2665   14.4542      NaN        C       14.50
114      0           2627   14.4583      NaN        C       17.00
119      2         347082   31.2750      NaN        S        2.00
147      2     W./C. 6608   34.3750      NaN        S        9.00
156      0          35851    7.7333      NaN        Q       16.00
172      1         347742   11.1333      NaN        S        1.00
184      2         315153   22.0250      NaN        S        4.00
205      1         347054   10.4625       G6        S        2.00
208      0         367231    7.7500      NaN        Q       16.00
233      2         347077   31.3875      NaN        S        5.00
237      2     C.A. 31921   26.2500      NaN        S        8.00
297      2         113781  151.5500  C22 C26        S        2.00
307      0       PC 17758  108.9000      C65        C       17.00
329      1         111361   57.9792      B18        C       16.00
374      1         349909   21.0750      NaN        S        3.00
381      2           2653   15.7417      NaN        C        1.00
389      0        SC 1748   12.0000      NaN        C       17.00
419      2         345773   24.1500      NaN        S       10.00
435      2         113760  120.0000  B96 B98        S       14.00
446      1         250644   19.5000      NaN        S       13.00
448      1           2666   19.2583      NaN        C        5.00
469      1           2666   19.2583      NaN        C        0.75
479      1        3101298   12.2875      NaN        S        2.00
504      0         110152   86.5000      B79        S       16.00
530      1          26360   26.0000      NaN        S        2.00
535      2   F.C.C. 13529   26.2500      NaN        S        7.00
541      2         347082   31.2750      NaN        S        9.00
542      2         347082   31.2750      NaN        S       11.00
618      1         230136   39.0000       F4        S        4.00
634      2         347088   27.9000      NaN        S        9.00
642      2         347088   27.9000      NaN        S        2.00
644      1           2666   19.2583      NaN        C        0.75
689      1          24160  211.3375       B5        S       15.00
691      1         349256   13.4167      NaN        C        4.00
720      1         248727   33.0000      NaN        S        6.00
750      1          29103   23.0000      NaN        S        4.00
777      0         364516   12.4750      NaN        S        5.00
780      0           2687    7.2292      NaN        C       13.00
781      0          17474   57.0000      B20        S       17.00
813      2         347082   31.2750      NaN        S        6.00
830      0           2659   14.4542      NaN        C       15.00
852      1           2678   15.2458      NaN        C        9.00
853      1       PC 17592   39.4000      D28        S       16.00
875      0           2667    7.2250      NaN        C       15.00

     fare_per_year  fare_per_class age_group
9         2.147914       15.035400     child
10        4.175000        5.566667     child
14        0.561014        2.618067     child
22        0.535280        2.676400     child
24        2.634375        7.025000     child
39        0.802979        3.747233     child
43       13.859733       20.789600     child
58        5.550000       13.875000     child
68        0.466176        2.641667     child
71        2.931250       15.633333     child
84        0.617647        5.250000     child
111       0.996841        4.818067     child
114       0.850488        4.819433     child
119      15.637500       10.425000     child
147       3.819444       11.458333     child
156       0.483331        2.577767     child
172      11.133300        3.711100     child
184       5.506250        7.341667     child
205       5.231250        3.487500     child
208       0.484375        2.583333     child
233       6.277500       10.462500     child
237       3.281250       13.125000     child
297      75.775000      151.550000     child
307       6.405882      108.900000     child
329       3.623700       57.979200     child
374       7.025000        7.025000     child
381      15.741700        5.247233     child
389       0.705882        6.000000     child
419       2.415000        8.050000     child
435       8.571429      120.000000     child
446       1.500000        9.750000     child
448       3.851660        6.419433     child
469      25.677733        6.419433     child
479       6.143750        4.095833     child
504       5.406250       86.500000     child
530      13.000000       13.000000     child
535       3.750000       13.125000     child
541       3.475000       10.425000     child
542       2.843182       10.425000     child
618       9.750000       19.500000     child
634       3.100000        9.300000     child
642      13.950000        9.300000     child
644      25.677733        6.419433     child
689      14.089167      211.337500     child
691       3.354175        4.472233     child
720       5.500000       16.500000     child
750       5.750000       11.500000     child
777       2.495000        4.158333     child
780       0.556092        2.409733     child
781       3.352941       57.000000     child
813       5.212500       10.425000     child
830       0.963613        4.818067     child
852       1.693978        5.081933     child
853       2.462500       39.400000     child
875       0.481667        2.408333     child
Number of female passengers under 18: {len(female_under_18)}

Subsetting Rows by Categorical variables:
1. Filter the Titanic dataset for passengers whose Embarked port is either "C" (Cherbourg) or "S"
(Southampton), assigning the result to embarked c or s. View the printed result.

In [110]:
embarked_c_or_s = df[df['Embarked'].isin(['C', 'S'])]
print("4. Passengers Embarked from C (Cherbourg) or S (Southampton):")
print(embarked_c_or_s)
print(f"\nNumber of passengers from C or S: {len(embarked_c_or_s)}")

4. Passengers Embarked from C (Cherbourg) or S (Southampton):
     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
884          885         0       3
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
884                             Sutehall, Mr. Henry Jr    male  25.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
884      0   SOTON/OQ 392076   7.0500   NaN        S
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C

[812 rows x 12 columns]

Number of passengers from C or S: 812

2. Filter the Titanic dataset for passengers whose Pclass is in the list [1, 2] (indicating first
or second class), assigning the result to first second class.View the printed result.

In [111]:
first_second_class = df[df['Pclass'].isin([1, 2])]
print("5. First and Second Class Passengers:")
print(first_second_class)
print(f"\nNumber of first and second class passengers: {len(first_second_class)}")

5. First and Second Class Passengers:
     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
6              7         0       1
9             10         1       2
11            12         1       1
..           ...       ...     ...
880          881         1       2
883          884         0       2
886          887         0       2
887          888         1       1
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
..                                                 ...     ...   ...    ...
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch            Ticket     Fare Cabin Embarked
1        0          PC 17599  71.2833   C85        C
3        0            113803  53.1000  C123        S
6        0             17463  51.8625   E46        S
9        0            237736  30.0708   NaN        C
11       0            113783  26.5500  C103        S
..     ...               ...      ...   ...      ...
880      1            230433  26.0000   NaN        S
883      0  C.A./SOTON 34068  10.5000   NaN        S
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
889      0            111369  30.0000  C148        C

[400 rows x 12 columns]

Number of first and second class passengers: 400

3.2 Exploratory Data Analysis Practice Exercise - 1.
Warning: Handle missing values in the Age column by filling them with the median age of

the dataset before performing the division.)

Answer the following questions from Dataset:
Which passenger had the highest fare paid relative to their age?
To answer the question perform following operations:
1. Add a column to the Titanic dataset, fare per year, containing the fare divided by the age of
the passenger(i.e., Fare/Age).

In [112]:
# Handle missing values in Age column
median_age = df['Age'].median()
df['Age_filled'] = df['Age'].fillna(median_age)

In [113]:
df['fare_per_year'] = df['Fare'] / df['Age_filled']
# print(df['fare_per_year'])

2. Subset rows where fare per year is higher than 5, assigning this to high fare age.

In [114]:
high_fare_age = df[df['fare_per_year'] > 5]
# print(high_fare_age)

3. Sort high fare age by descending fare per year, assigning this to high fare age srt.

In [115]:
high_fare_age_srt = high_fare_age.sort_values('fare_per_year', ascending=False)
# print(high_fare_age_srt)

4. Select only the Name and fare per year columns of high fare age srt and save the result as result.

In [116]:
result1 = high_fare_age_srt[['Name', 'fare_per_year']]

5. Look at the result.

In [117]:
print("Passengers with highest fare paid relative to age (fare_per_year > 5):")
print(result1.head(10))

Passengers with highest fare paid relative to age (fare_per_year > 5):
                                Name  fare_per_year
305   Allison, Master. Hudson Trevor     164.728261
297     Allison, Miss. Helen Loraine      75.775000
386  Goodwin, Master. Sidney Leonard      46.900000
164     Panula, Master. Eino Viljami      39.687500
183        Becker, Master. Richard F      39.000000
827            Mallet, Master. Andre      37.004200
78     Caldwell, Master. Alden Gates      34.939759
644           Baclini, Miss. Eugenie      25.677733
469    Baclini, Miss. Helene Barbara      25.677733
831  Richards, Master. George Sibley      22.590361

Which adult male passenger (age ≥ 18 and Sex is ’male’) paid the highest fare relative to their
class?
To answer the question perform following operations:
1. Add a column to the Titanic dataset, fare per class, containing the fare divided by the passenger
class i.e. Fare / Pclass.

In [118]:
df['fare_per_class'] = df['Fare'] / df['Pclass']

2. Subset rows where the passenger is male (Sex is ”male”) and an adult (Age is greater than or equal
to 18), assigning this to adult males.

In [119]:
adult_males = df[(df['Sex'] == 'male') & (df['Age_filled'] >= 18)]

3. Sort adult males by descending fare per class, assigning this to adult males srt.

In [120]:
adult_males_srt = adult_males.sort_values('fare_per_class', ascending=False)

4. Select only the Name, Age, and fare per class columns of adult males sr and save the result
as result.

In [121]:
result2 = adult_males_srt[['Name', 'Age_filled', 'fare_per_class']]

5. Look at the result.

In [122]:
print("Adult male passengers with highest fare relative to class:")
print(result2.head(10))

Adult male passengers with highest fare relative to class:
                                   Name  Age_filled  fare_per_class
737              Lesurer, Mr. Gustave J        35.0        512.3292
679  Cardeza, Mr. Thomas Drake Martinez        36.0        512.3292
27       Fortune, Mr. Charles Alexander        19.0        263.0000
438                   Fortune, Mr. Mark        64.0        263.0000
118            Baxter, Mr. Quigg Edmond        24.0        247.5208
557                 Robbins, Mr. Victor        28.0        227.5250
527                  Farthing, Mr. John        28.0        221.7792
377           Widener, Mr. Harry Elkins        27.0        211.5000
332           Graham, Mr. George Edward        38.0        153.4625
373                 Ringhini, Mr. Sante        22.0        135.6333

3.3 Exploratory Data Analysis with Group-by Method Practice Exercise:
Based on the dataset Answer the following question:
What percent of the total fare revenue came from each passenger class?
To answer the question perform following operation:
1. Calculate the total Fare paid across all passengers in the Titanic dataset.

In [123]:
total_fare = df['Fare'].sum()

2. Subset for passengers in first class (Pclass is 1) and calculate their total fare.

In [124]:
first_class_fare = df[df['Pclass'] == 1]['Fare'].sum()
second_class_fare = df[df['Pclass'] == 2]['Fare'].sum()
third_class_fare = df[df['Pclass'] == 3]['Fare'].sum()

3. Do the same for second class (Pclass is 2) and third class (Pclass is 3).

In [125]:
class_fares = [first_class_fare, second_class_fare, third_class_fare]

4. Combine the fare totals from first, second, and third classes into a list.

In [126]:
class_proportions = [fare/total_fare for fare in class_fares]

print("Fare Revenue Distribution by Class:")
print(f"Total Fare Revenue: ${total_fare:.2f}")
print(f"1st Class: ${first_class_fare:.2f} ({class_proportions[0]*100:.2f}%)")
print(f"2nd Class: ${second_class_fare:.2f} ({class_proportions[1]*100:.2f}%)")
print(f"3rd Class: ${third_class_fare:.2f} ({class_proportions[2]*100:.2f}%)")

Fare Revenue Distribution by Class:
Total Fare Revenue: $28693.95
1st Class: $18177.41 (63.35%)
2nd Class: $3801.84 (13.25%)
3rd Class: $6714.70 (23.40%)

What percent of the total number of passengers on the Titanic belonged to each age group
(e.g., child, adult, senior)?
To answer the question perform following operation:
1. Create a new column, age group, that categorizes passengers into "child" (age < 18), "adult" (age
18{64), and "senior" (age 65 and above).

In [127]:
def categorize_age(age):
    if pd.isna(age):
        return 'unknown'
    elif age < 18:
        return 'child'
    elif age < 65:
        return 'adult'
    else:
        return 'senior'

df['age_group'] = df['Age'].apply(categorize_age)

2. Calculate the total number of passengers on the Titanic.

In [128]:
total_passengers = len(df)

3. Count the number of passengers in each age group.

In [129]:
age_group_counts = df['age_group'].value_counts()

4. Divide the count of each age group by the total number of passengers to get the proportion of passengers
in each age group.

In [130]:
age_group_proportions = age_group_counts / total_passengers

5. Display the proportion as a percentage.

In [131]:
print("Passenger Distribution by Age Group:")
print(f"Total Passengers: {total_passengers}")
for group in ['child', 'adult', 'senior', 'unknown']:
    if group in age_group_counts:
        count = age_group_counts[group]
        proportion = age_group_proportions[group]
        print(f"{group.capitalize()}: {count} passengers ({proportion*100:.2f}%)")

Passenger Distribution by Age Group:
Total Passengers: 891
Child: 113 passengers (12.68%)
Adult: 590 passengers (66.22%)
Senior: 11 passengers (1.23%)
Unknown: 177 passengers (19.87%)